Revit 2026 API

# ExternalServicesBuiltInExternalServicesAXMImporterService Property

---

The external service which permits registration of an alternate implementation for AXM import.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ExternalServiceId AXMImporterService { get; }
```
```vb
Public Shared ReadOnly Property AXMImporterService As ExternalServiceId
	Get
```
```cpp
public:
static property ExternalServiceId^ AXMImporterService {
	ExternalServiceId^ get ();
}
```
```fsharp
static member AXMImporterService : ExternalServiceId with get
```

#### Property Value

ExternalServiceId

#### Reference

ExternalServicesBuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace